FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_Timer.c
    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint / (PROCESSOR_OSCILLATOR_FREQUENCY
        / PCLK_FREQUENCY);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Internal Information tables:
 *---------------------------------------------------------------------------*/
static const T_LPC1788_Timer_Info G_Timer0_Info = {
        TIMER0_IRQn,
        (TISRFPtr)Timer0_ISR,
        "Timer0",
        1, };

static const T_LPC1788_Timer_Info G_Timer1_Info = {
        TIMER1_IRQn,
        (TISRFPtr)Timer1_ISR,
        "Timer1",
        2, };

static const T_LPC1788_Timer_Info G_Timer2_Info = {
        TIMER2_IRQn,
        (TISRFPtr)Timer2_ISR,
        "Timer2",
        22, };

static const T_LPC1788_Timer_Info G_Timer3_Info = {
        TIMER3_IRQn,
        (TISRFPtr)Timer3_ISR,
        "Timer3",
        23, };

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_Timer LPC1788_Timer0_Interface = {
    {
    "NXP:LPC1788:Timer0",
    0x0100,
    LPC1788_Timer0_InitializeWorkspace,
    sizeof(T_LPC1788_Timer_Workspace),
    },

    LPC1788_Timer_SetTimerMode,
    LPC1788_Timer_SetCaptureSource,
    LPC1788_Timer_SetMatchRegister,
    LPC1788_Timer_SetExternalControl,
    LPC1788_Timer_Reset,
    LPC1788_Timer_Enable,
    LPC1788_Timer_Disable,
    LPC1788_Timer_SetMatchCallback,
    LPC1788_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1788_Timer1_Interface = {
    {
    "NXP:LPC1788:Timer1",
    0x0100,
    LPC1788_Timer1_InitializeWorkspace,
    sizeof(T_LPC1788_Timer_Workspace),
    },

    LPC1788_Timer_SetTimerMode,
    LPC1788_Timer_SetCaptureSource,
    LPC1788_Timer_SetMatchRegister,
    LPC1788_Timer_SetExternalControl,
    LPC1788_Timer_Reset,
    LPC1788_Timer_Enable,
    LPC1788_Timer_Disable,
    LPC1788_Timer_SetMatchCallback,
    LPC1788_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1788_Timer2_Interface = {
    {
    "NXP:LPC1788:Timer2",
    0x0100,
    LPC1788_Timer2_InitializeWorkspace,
    sizeof(T_LPC1788_Timer_Workspace),
    },

    LPC1788_Timer_SetTimerMode,
    LPC1788_Timer_SetCaptureSource,
    LPC1788_Timer_SetMatchRegister,
    LPC1788_Timer_SetExternalControl,
    LPC1788_Timer_Reset,
    LPC1788_Timer_Enable,
    LPC1788_Timer_Disable,
    LPC1788_Timer_SetMatchCallback,
    LPC1788_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1788_Timer3_Interface = {
    {
    "NXP:LPC1788:Timer3",
    0x0100,
    LPC1788_Timer3_InitializeWorkspace,
    sizeof(T_LPC1788_Timer_Workspace),
    },

    LPC1788_Timer_SetTimerMode,
    LPC1788_Timer_SetCaptureSource,
    LPC1788_Timer_SetMatchRegister,
    LPC1788_Timer_SetExternalControl,
    LPC1788_Timer_Reset,
    LPC1788_Timer_Enable,
    LPC1788_Timer_Disable,
    LPC1788_Timer_SetMatchCallback,
    LPC1788_Timer_SetMatchRegisterFunctions,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_Timer0_Require(const T_LPC1788_Timer_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_26, IOCON_D_DEFAULT(3)}, // T0_CAP0
            {GPIO_P3_23, IOCON_D_DEFAULT(3)}, // T0_CAP0
    };
    static const T_LPC1788_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_27, IOCON_D_DEFAULT(3)}, // T0_CAP1
            {GPIO_P3_24, IOCON_D_DEFAULT(3)}, // T0_CAP1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_28, IOCON_D_DEFAULT(3)}, // T0_MAT0
            {GPIO_P3_25, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_29, IOCON_D_DEFAULT(3)}, // T0_MAT1
            {GPIO_P3_26, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer0
    HALInterfaceRegister("Timer0", (T_halInterface *)&LPC1788_Timer0_Interface,
            0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], 0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC1788_Timer1_Require(const T_LPC1788_Timer_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_18, IOCON_D_DEFAULT(3)}, // T1_CAP0
            {GPIO_P3_27, IOCON_D_DEFAULT(3)}, // T1_CAP0
    };
    static const T_LPC1788_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_19, IOCON_D_DEFAULT(3)}, // T1_CAP1
            {GPIO_P3_28, IOCON_D_DEFAULT(3)}, // T1_CAP1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(3)}, // T1_MAT0
            {GPIO_P3_29, IOCON_D_DEFAULT(3)}, // T1_MAT0
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_25, IOCON_D_DEFAULT(3)}, // T1_MAT1
            {GPIO_P3_30, IOCON_D_DEFAULT(3)}, // T1_MAT1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT2[] = {
            {GPIO_P3_31, IOCON_D_DEFAULT(3)}, // T1_MAT2
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer1
    HALInterfaceRegister("Timer1", (T_halInterface *)&LPC1788_Timer1_Interface,
            0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC1788_Timer2_Require(const T_LPC1788_Timer_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P0_4,  IOCON_D_DEFAULT(3)}, // T2_CAP0
            {GPIO_P1_14, IOCON_D_DEFAULT(3)}, // T2_CAP0
            {GPIO_P2_6,  IOCON_D_DEFAULT(3)}, // T2_CAP0
            {GPIO_P2_14, IOCON_D_DEFAULT(3)}, // T2_CAP0
    };
    static const T_LPC1788_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P0_5,  IOCON_D_DEFAULT(3)}, // T2_CAP1
            {GPIO_P2_15, IOCON_D_DEFAULT(3)}, // T2_CAP1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(3)}, // T2_MAT0
            {GPIO_P2_5,  IOCON_D_DEFAULT(3)}, // T2_MAT0
            {GPIO_P4_28, IOCON_D_DEFAULT(3)}, // T2_MAT0
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P0_7,  IOCON_W_DEFAULT(3)}, // T2_MAT1
            {GPIO_P2_4,  IOCON_D_DEFAULT(3)}, // T2_MAT1
            {GPIO_P4_29, IOCON_D_DEFAULT(3)}, // T2_MAT1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT2[] = {
            {GPIO_P0_8,  IOCON_W_DEFAULT(3)}, // T2_MAT2
            {GPIO_P2_3,  IOCON_D_DEFAULT(3)}, // T2_MAT2
            {GPIO_P5_0,  IOCON_D_DEFAULT(3)}, // T2_MAT2
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT3[] = {
            {GPIO_P0_9,  IOCON_W_DEFAULT(3)}, // T2_MAT3
            {GPIO_P2_2,  IOCON_D_DEFAULT(3)}, // T2_MAT3
            {GPIO_P5_1,  IOCON_D_DEFAULT(3)}, // T2_MAT3
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer2
    HALInterfaceRegister("Timer2", (T_halInterface *)&LPC1788_Timer2_Interface,
            0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT3,
            ARRAY_COUNT(pinsMAT3));
}

void LPC1788_Timer3_Require(const T_LPC1788_Timer_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_10, IOCON_D_DEFAULT(3)}, // T3_CAP0
            {GPIO_P2_22, IOCON_D_DEFAULT(3)}, // T3_CAP0
            {GPIO_P0_23, IOCON_W_DEFAULT(3)}, // T3_CAP0
    };
    static const T_LPC1788_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_0,  IOCON_D_DEFAULT(3)}, // T3_CAP1
            {GPIO_P2_23, IOCON_D_DEFAULT(3)}, // T3_CAP1
            {GPIO_P0_24, IOCON_W_DEFAULT(3)}, // T3_CAP1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P0_10, IOCON_D_DEFAULT(3)}, // T3_MAT0
            {GPIO_P1_9,  IOCON_D_DEFAULT(3)}, // T3_MAT0
            {GPIO_P2_26, IOCON_D_DEFAULT(3)}, // T3_MAT0
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P0_11, IOCON_D_DEFAULT(3)}, // T3_MAT1
            {GPIO_P1_8,  IOCON_D_DEFAULT(3)}, // T3_MAT1
            {GPIO_P2_27, IOCON_D_DEFAULT(3)}, // T3_MAT1
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT2[] = {
            {GPIO_P1_4,  IOCON_D_DEFAULT(3)}, // T3_MAT2
            {GPIO_P2_30, IOCON_D_DEFAULT(3)}, // T3_MAT2
            {GPIO_P5_2,  IOCON_I_DEFAULT(3)}, // T3_MAT2
    };
    static const T_LPC1788_IOCON_ConfigList pinsMAT3[] = {
            {GPIO_P1_1,  IOCON_D_DEFAULT(3)}, // T3_MAT3
            {GPIO_P2_31, IOCON_D_DEFAULT(3)}, // T3_MAT3
            {GPIO_P5_4,  IOCON_D_DEFAULT(3)}, // T3_MAT3
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer3
    HALInterfaceRegister("Timer3", (T_halInterface *)&LPC1788_Timer3_Interface,
            0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT3,
            ARRAY_COUNT(pinsMAT3));
}

/*-------------------------------------------------------------------------*
 * End of File:  Timer.c
 *-------------------------------------------------------------------------*/

